Revit 2024 API
BRepBuilderEdgeGeometry.Create Method
Overload List
Name | Description
Create(Curve)
 Construct BRepBuilderEdgeGeometry based on any GCurve, including GLine and GArc. The curve will be simplified if possible, and the concrete type of the returned value will reflect that simplification: BRepBuilderLinearEdgeGeometry if the curve could be simplified to a line, BRepBuilderArcEdgeGeometry if it could be simplified to an arc, BRepBuilderGenericCurveEdgeGeometry otherwise.
Create(XYZ, XYZ)
 Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points.
See Also
BRepBuilderEdgeGeometry Class
BRepBuilderEdgeGeometry Members
Autodesk.Revit.DB Namespace